# Координаты для станции АКЖТ и промежуточной.
# Временные имена взяты из файла `akzt_v2.sig`.
# Позже можно просто переименовать ключи под свои обозначения.

positions = {
    # Стрелки
    "point1": (75, 225),
    "point2": (175, 175),
    "point3": (150, 200),
    "point4": (452, 225),
    "point5": (529, 174),
    "point6": (175, 225),
    "point7": (625, 200),
    "point8": (500, 225),
    "point9": (575, 200),
    "point10": (175, 350),
    "point11": (250, 375),
    "point12": (375, 176),
    "point13": (175, 200),
    "point14": (50, 200),
    "point16": (100, 200),

    # Светофоры
    "Ч": (25, 225),
    "signal3": (100, 175),
    "signal4": (200, 150),
    "signal5": (323, 150),
    "signal6": (0, 225),
    "signal7": (650, 172),
    "signal8": (275, 200),
    "signal9": (375, 200),
    "signal10": (350, 175),
    "signal11": (250, 225),
    "signal12": (250, 250),
    "signal13": (350, 250),
    "signal14": (375, 225),
    "signal15": (550, 225),
    "signal16": (625, 225),
    "signal17": (700, 200),
    "signal18": (775, 200),
    "signal19": (875, 200),
    "signal20": (975, 200),
    "signal21": (0, 200),
    "signal22": (800, 225),
    "signal23": (900, 225),
    "signal24": (207, 198),
    "signal25": (225, 350),
    "signal26": (325, 350),
    "signal27": (50, 375),
    "signal28": (150, 375),
    "signal29": (325, 400),
    "signal30": (400, 400),
    "signal31": (400, 400),
    "signal32": (525, 400),
    "signal33": (650, 200),
    "signal35": (250, 175),
    "signal36": (576, 172),
}

# Сегменты между точками.
# Формат простой: ("точка_1", "точка_2")
segments = [
    # Пример:
    # ("point1", "point6"),
    # ("signal8", "signal9"),
    # ("point6", "signal11"),
]
