# Координаты для станции АКЖТ и промежуточной.
# Временные имена взяты из файла `akzt_v2.sig`.
# Позже можно просто переименовать ключи под свои обозначения.

positions = {
    # Стрелки
    # "point1": (75, 225),
    # "point2": (175, 175),
    # "point3": (150, 200),
    # "point4": (452, 225),
    # "point5": (529, 174),
    # "point6": (175, 225),
    # "point7": (625, 200),
    # "point8": (500, 225),
    # "point9": (575, 200),
    # "point10": (175, 350),
    # "point11": (250, 375),
    # "point12": (375, 176),
    # "point13": (175, 200),
    # "point14": (50, 200),
    # "point16": (100, 200),

    # Светофоры
    "signal2": (25, 225),
    "signal3": (100, 175),
    "signal4": (200, 150),
    "signal5": (323, 150),
    "signal7": (650, 172),
    "Ч1": (375, 200),
    "M1": (490, 200),
    "signal10": (350, 175),
    "signal11": (250, 225),
    "signal12": (250, 250),
    "signal13": (350, 250),
    "signal14": (375, 225),
    "signal15": (550, 225),
    "signal16": (625, 225),
    "1": (650, 200),
    "5": (770, 200),
    "3": (710, 200),
    "signal20": (975, 200),
    "M6": (50, 200),
    "signal22": (800, 200),
    "signal23": (900, 225),
    "H1": (150, 200),
    "signal25": (225, 350),
    "signal26": (325, 350),
    "signal27": (50, 375),
    "signal28": (150, 375),
    "signal29": (325, 400),
    "signal30": (400, 400),
    "signal31": (400, 400),
    "signal32": (525, 400),
    "H": (580, 200),
    "signal35": (250, 175),
    "signal36": (576, 172),
}

# Сегменты между точками.
# Формат простой: ("точка_1", "точка_2")
segments = [
    ("signal4", "signal5"),
    ("M6", "H1"),
    ("H1", "Ч1"),
    ("Ч1", "M1"),
    ("M1", "H"),
    ("H", "1"),
    ("1", "3"),
    ("3", "5"),
    # Пример:
    # ("point1", "point6"),
    # ("signal8", "signal9"),
    # ("point6", "signal11"),
]
